a=int(input('please input a number:\n'))
b=a-2000
if b<500:
    print('你的个人所得税为:',0.05*b,',','税后实际收入为:',a-0.05*b)
elif 500<=b<2000:
    print('你的个人所得税为:',25+(b-500)*0.1,',','税后实际收入为:',a-(25+(b-500)*0.1))
elif 2000<=b<5000:
    print('你的个人所得税为:',175+(b-2000)*0.15,',','税后实际收入为:',a-(175+(b-2000)*0.15))
elif 5000<=b<20000:
    print('你的个人所得税为:',625+(b-5000)*0.2,',','税后实际收入为:',a-(625+(b-5000)*0.2))
elif 20000<=b<40000:
    print('你的个人所得税为:',3625+(b-20000)*0.25,',','税后实际收入为:',a-(3625+(b-20000)*0.25))
elif 40000<=b<60000:
    print('你的个人所得税为:',8625+(b-40000)*0.3,',','税后实际收入为:',a-(8625+(b-40000)*0.3))
elif 60000<=b<80000:
    print('你的个人所得税为:',14625+(b-60000)*0.35,',','税后实际收入为:',a-(14625+(b-60000)*0.35))
elif 80000<=b<100000:
    print('你的个人所得税为:',21625+(b-80000)*0.4,',','税后实际收入为:',a-(21625+(b-80000)*0.4))
elif b>=100000:
    print('你的个人所得税为:',29625+(b-100000)*0.45,',','税后实际收入为:',a-(29625+(b-100000)*0.45))
    
