
'''

今天2019.12月2号
****************
还有一个月就元旦啦
****************
新的一年要来啦
****************
我也要长大一岁啦
****************

'''

# 特定功能代码块 函数
# 打印一行20个星号
def star(num,symbol,s):
    print(s)
    for i in range(num):
        print(symbol,end="")
    print()

# print('今天2019.12月2号')
# print('*' * 20)
# 调用函数
star(20,'_','床前明月光')
# print('还有一个月就元旦啦')
# print('*' * 20)
star(30,"#",'疑是地上霜')
# print('新的一年要来啦')
# print('*' * 20)
star(40,'+','天王盖地虎')
# print('我也要长大一岁啦')
# print('*' * 20)
star(50,"~",'小鸡炖蘑菇')


# ctrl + r  查找+替换


# 列表 元组 字符串  常用方法
# split(分隔符) 字符串方法
# python中 函数 是 一等公民 函数式编程


# 图书管理系统

